stress_test/proxyTest.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: proxyStressTest.js

    duration: 1m0s, iterations: -
         vus: 600,  max: 600

    init [----------------------------------------------------------] starting
    data_received..............: 13 MB  221 kB/s
    data_sent..................: 935 kB 16 kB/s
    http_req_blocked...........: avg=15.29ms  min=0s      med=359µs max=1.24s   p(90)=1.98ms p(95)=111.18ms
    http_req_connecting........: avg=15.28ms  min=124µs   med=255µs max=1.24s   p(90)=1.84ms p(95)=111.5ms 
    http_req_duration..........: avg=3.67s    min=0s      med=3.41s max=6.13s   p(90)=5.08s  p(95)=5.58s   
    http_req_receiving.........: avg=54.58µs  min=0s      med=46µs  max=3.39ms  p(90)=76µs   p(95)=107µs   
    http_req_sending...........: avg=113.02µs min=0s      med=79µs  max=12.39ms p(90)=163µs  p(95)=238µs   
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s    max=0s      p(90)=0s     p(95)=0s      
    http_req_waiting...........: avg=3.67s    min=0s      med=3.41s max=6.12s   p(90)=5.08s  p(95)=5.58s   
    http_reqs..................: 9358   155.966112/s
    iteration_duration.........: avg=3.7s     min=11.73ms med=3.43s max=7.52s   p(90)=5.1s   p(95)=5.66s   
    iterations.................: 9358   155.966112/s
    vus........................: 600    min=600 max=600
    vus_max....................: 600    min=600 max=600